---
permalink: system-admin/commands-manage-feature-licenses-reference.html 
sidebar: sidebar 
keywords: command, manage, license, command, cluster, system, feature, usage, usage 
summary: Sie verwenden die Systemlizenzbefehle, um Funktionslizenzen für den Cluster zu verwalten. Sie verwenden die Befehle zur Nutzung der Systemfunktionen, um die Nutzung der Funktionen zu überwachen. 
---
= Befehle zum Verwalten von Lizenzen
:allow-uri-read: 
:icons: font
:imagesdir: ../media/


[role="lead"]
Sie verwenden das `system license` Befehle zum Verwalten von Funktionslizenzen für den Cluster. Sie verwenden das `system feature-usage` Befehle für das Überwachen der Funktionsnutzung.

[cols="2,4"]
|===
| Ihr Ziel ist | Befehl 


 a| 
Fügen Sie eine oder mehrere Lizenzen hinzu
 a| 
`system license add`

.Beispiele
Im folgenden Beispiel wird eine Liste der Lizenzen mit den Schlüsseln AAAAAAAAAAAAAAAAAAAAAAAAAAAA und BBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBB zum Cluster hinzugefügt:

[]
====
Cluster1::> Systemlizenz hinzufügen -Lizenzcode AAAAAAAAAAAAAAAAAAAAAAAAAA, BBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBB

====
Im folgenden Beispiel werden die Lizenzen vom lokalen Knoten „/mroot/etc/lic_file“ installiert:

[]
====
Cluster1::> System license add -use-license-file true

====


 a| 
Informationen über installierte Lizenzen anzeigen, z. B.:

* Name und Beschreibung des Lizenzpakets
* Lizenztyp (`site`, `license`, Oder `demo`)
* Ablaufdatum, falls zutreffend
* Den Cluster oder Nodes, für die ein Paket lizenziert ist
* Gibt an, ob die Lizenz vor Data ONTAP 8.2 installiert wurde (`legacy`)
* Kunden-ID

 a| 
`system license show`

[NOTE]
====
Einige Informationen werden nur angezeigt, wenn Sie das verwenden `–instance` Parameter.

====


 a| 
Alle Pakete anzeigen, die Lizenzen und ihren aktuellen Lizenzstatus benötigen, einschließlich:

* Der Paketname
* Die lizenzierte Methode
* Das Ablaufdatum, falls zutreffend

 a| 
`system license show-status`

.Beispiel
Im folgenden Beispiel wird der Lizenzstatus des Clusters angezeigt:

[]
====
Cluster1::> Systemlizenz show-Status
Statuslizenz Umfang Detaillierter Status
--------- ------------------- --------- -----------------------
Teilweise installiert
          CIFS Knoten Lizenz fehlt auf: Node2-cluster1.
          SnapRestore Knoten Lizenz fehlt auf: Node2-cluster1.
Gültig
          FCP Knoten -
          FabricPool Das Cluster-System verwendet 1 TB und kann bis zu 25 TB verwenden.
Nicht installiert
          NFS - -
          ISCSI - -
          SnapMirror - -
          FlexClone - -
          SnapVault - -
          SnapLock - -
          SnapManagerSuite - -
          SnapProtectApps - -
          V_StorageAttach - -
          Insight_Balance - -
          OCShift - -
          TPM - -
          VE - -
          DP_optimiert - -
Nicht zutreffend
          Cloud - -
          Wählen Sie - -
Es wurden 20 Einträge angezeigt.

====


 a| 
Löschen Sie die Lizenz eines Pakets aus dem Cluster oder einem Node, dessen Seriennummer Sie angeben
 a| 
`system license delete`

.Beispiele
Im folgenden Beispiel wird eine Lizenz namens CIFS und die Seriennummer 1-81-0000000000000000000123456 aus dem Cluster gelöscht:

[]
====
Cluster1::> System license delete -serial-number 1-81-0000000000000000000123456 -package CIFS

====
Im folgenden Beispiel werden alle Lizenzen aus dem Cluster unter der installierten Lizenz des Core Bundle für die Seriennummer 123456789 gelöscht:

[]
====
Cluster1::> System license delete { -serial-number 123456789 -installed-license „Core Bundle“ }

====


 a| 
Abgelaufene oder nicht verwendete Lizenzen anzeigen oder entfernen
 a| 
`system license clean-up`

.Beispiele
Das folgende Beispiel simuliert und zeigt die Lizenzen an, die bereinigt werden können:

[]
====
Cluster-1::> System License clean-up -expired -unused

Die folgenden Lizenzen wurden sicher gelöscht:

Seriennummer: 1-80-000011
Besitzer: Cdancluster-1
Paket Grund
-------------------------- --------------------------------------------------------------------
CIFS Lizenz ist abgelaufen

Seriennummer: 4067154888
Besitzer: Keine
Paket Grund
-------------------------- --------------------------------------------------------------------
Cloud Lizenz ist abgelaufen

Seriennummer: 1-81-0000000000000004067154999
Besitzer: Keine
Paket Grund
-------------------------- --------------------------------------------------------------------
ISCSI Die Lizenz wird von einem beliebigen Node im Cluster nicht verwendet
Die folgenden Lizenzen sind entweder abgelaufen oder nicht verwendet, können aber nicht sicher gelöscht werden:

Seriennummer: 4067154778
Besitzer: Node1
Paket Grund
-------------------------- --------------------------------------------------------------------
Cloud Die Funktion wäre beim Entfernen beeinträchtigt

Seriennummer: 4067154779
Besitzer: Node2
Paket Grund
-------------------------- --------------------------------------------------------------------
Cloud Vom System generierte Lizenz

====


 a| 
Zusammenfassung der Funktionsnutzung im Cluster pro Node anzeigen
 a| 
`system feature-usage show-summary`



 a| 
Anzeige des Funktionsnutzungsstatus im Cluster auf Node- und Wochenbasis
 a| 
`system feature-usage show-history`



 a| 
Zeigen Sie den Status des Lizenzrisikos für jedes Lizenzpaket an
 a| 
`system license entitlement-risk show`

[NOTE]
====
Einige Informationen werden nur angezeigt, wenn Sie das verwenden `-detail` Und `-instance` Parameter.

====
|===
.Verwandte Informationen
http://docs.netapp.com/ontap-9/topic/com.netapp.doc.dot-cm-cmpr/GUID-5CB10C70-AC11-41C0-8C16-B4D0DF916E9B.html["ONTAP 9-Befehle"^]

https://kb.netapp.com/onprem/ontap/os/ONTAP_9.10.1_and_later_licensing_overview["Knowledge Base-Artikel: ONTAP 9.10.1 und höher Lizenzübersicht"^]

https://docs.netapp.com/us-en/ontap/task_admin_enable_new_features.html["Verwenden Sie System Manager, um eine NetApp Lizenzdatei zu installieren"^]
